package task02;

public class Ex02 {
//	2. 패키지명 task02, 클래스명 Ex02
//
//	아래 키워드에 대한 설명 작성하기 
//	new
	//new : 연산자로 주소값을 전달한다 
//			Heap연산자의 주소값을 stack영역으로 보내준다 
//	private, protected, private
	//private , protected, private 
	//private : 접근제어자로 클래스 내에서만 사용가능하게끔 제어하는역할을 한다
	//protected : 접근제어자로 클래스와 상속클래스 내에서만 사용가능하게끔 제어하는 역할을 한다
	//public : 모든 클래스에서 사용가능한 접근제어자이다 
//	static
	// 키워드로 method영역에 프로그램 시작과 동시에 메모리에 올려둔다는 뜻으로 
	// 객체가 다르더라도 가지고있는 주소값이 같기에 같은 값을 공유한다
	// 스태틱 멤버를 호출할때에는 클래스명을 사용하는 것을 권장한다
//	extends
	//상속관계에서 자식클래스가 부모클래스를 상속받는 다는 것을 표시하는 키워드이다 
//	class
	//클래스 프로젝트 내 패키지내 클래스가 있고 
	//필드 메서드 생성자 를 가질수 있고 
	//추상클래스나 익명클래스 등등 여러 클래스 종류가있다
	//다중상속이 불가하다 
	

}
